const wordList = [
  {
    word: "guitar",
    hint: "آلة موسيقية تحتوي على أوتار."
  },
  {
    word: "computer",
    hint: "جهاز إلكتروني يستخدم لمعالجة البيانات."
  },
  {
    word: "pizza",
    hint: "طبق إيطالي شهير يحتوي على قشرة ومكونات متنوعة، عادة ما تكون الجبنة من بينها."
  },
  {
    word: "soccer",
    hint: "رياضة تلعب بين فريقين بكرة دائرية."
  },
  {
    word: "oxygen",
    hint: "عنصر كيميائي ضروري للتنفس والاحتراق."
  },
  {
    word: "beach",
    hint: "منطقة رملية أو حصوية بجانب البحر أو البحيرة، غالبًا ما يتم زيارتها للترفيه."
  },
  {
    word: "book",
    hint: "عمل مكتوب أو مطبوع يتكون من صفحات ملزمة معًا."
  },
  {
    word: "mountain",
    hint: "تضاريس جغرافية كبيرة ترتفع فوق الأرض المحيطة بها، وعادة ما تكون جانبيها شديدين الانحدار."
  },
  {
    word: "coffee",
    hint: "مشروب معروف يحتوي على الكافيين ويصنع من حبوب البن المحمصة."
  },
  {
    word: "camera",
    hint: "جهاز يستخدم لالتقاط وتخزين الصور الفوتوغرافية أو مقاطع الفيديو."
  },
  {
    word: "piano",
    hint: "آلة موسيقية تعزف عن طريق الضغط على الأسلاك بمطرقة."
  },
  {
    word: "dog",
    hint: "ثديي مستأنس يتم تربيته كحيوان أليف أو استخدامه لأغراض مختلفة."
  },
  {
    word: "jazz",
    hint: "نوع من الموسيقى يتميز بالعزف التصويري والايقاع المتقطع."
  },
  {
    word: "planet",
    hint: "جسم سماوي يدور حول نجم ولا ينتج ضوءًا بنفسه."
  },
  {
    word: "chocolate",
    hint: "طعام حلو مصنوع من حبوب الكاكاو المحمصة والمطحونة."
  },
  {
    word: "car",
    hint: "مركبة على الطرق مع محرك مستخدمة للنقل."
  },
  {
    word: "painting",
    hint: "فن استخدام الطلاء لإنشاء صور أو تصاميم على سطح."
  },
  {
    word: "moon",
    hint: "القمر الطبيعي للأرض الذي يدور حولها."
  },
  
];
